# Assignment: 01

#### Load the Iris dataset into a pandas DataFrame

In [3]:
import numpy as np 
import pandas as pd
import seaborn as sns

df = sns.load_dataset('iris')
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

#### 1. Calculate the 75th percentile of the 'petal_width' column for each species in the Iris dataset.

In [4]:
df['petal_width'].quantile(0.75)

np.float64(1.8)

#### 2. Create a new column in the Iris DataFrame called 'sepal_area', which is the product of 'sepal_length' and 'sepal_width'.

In [5]:
df['sepal_area'] = df['sepal_length']*df['sepal_width']
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species  sepal_area
0           5.1          3.5           1.4          0.2  setosa       17.85
1           4.9          3.0           1.4          0.2  setosa       14.70

#### 3. Remove all rows in the Iris DataFrame where 'petal_length' is greater than twice the standard deviation of 'petal_length' for that species.

In [9]:
petal_length_std = df['petal_length'].std()
petal_length_std

np.float64(1.7652982332594662)

In [17]:
df = df.drop(df[df['petal_length'] > 2*petal_length_std].index)

#### 4. Normalize all numerical columns in the Iris DataFrame (except the 'species' column) using Min-Max scaling.

In [18]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species',
       'sepal_area'],
      dtype='object')

In [21]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
model = scaler.fit(df[['sepal_length', 'sepal_width', 'petal_length', 'petal_width','sepal_area']])
scaled_data = model.transform(df[['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'sepal_area']])

In [23]:
scaled_data

array([[0.53333333, 0.625     , 0.16      , 0.1       , 0.52055703],
       [0.4       , 0.41666667, 0.16      , 0.1       , 0.31167109],
       [0.26666667, 0.5       , 0.12      , 0.1       , 0.33421751],
       [0.2       , 0.45833333, 0.2       , 0.1       , 0.28249337],
       [0.46666667, 0.66666667, 0.16      , 0.1       , 0.53050398],
       [0.73333333, 0.79166667, 0.28      , 0.3       , 0.73342175],
       [0.2       , 0.58333333, 0.16      , 0.2       , 0.37400531],
       [0.46666667, 0.58333333, 0.2       , 0.1       , 0.46419098],
       [0.06666667, 0.375     , 0.16      , 0.1       , 0.18302387],
       [0.4       , 0.45833333, 0.2       , 0.        , 0.34416446],
       [0.73333333, 0.70833333, 0.2       , 0.1       , 0.66180371],
       [0.33333333, 0.58333333, 0.24      , 0.1       , 0.41909814],
       [0.33333333, 0.41666667, 0.16      , 0.        , 0.29177719],
       [0.        , 0.41666667, 0.04      , 0.        , 0.19230769],
       [1.        , 0.83333333, 0.08      , 0.1       , 0.87533156],
       [0.93333333, 1.        , 0.2       , 0.3       , 1.        ],
       [0.73333333, 0.79166667, 0.12      , 0.3       , 0.73342175],
       [0.53333333, 0.625     , 0.16      , 0.2       , 0.52055703],
       [0.93333333, 0.75      , 0.28      , 0.2       , 0.77320955],
       [0.53333333, 0.75      , 0.2       , 0.2       , 0.62201592],
       [0.73333333, 0.58333333, 0.28      , 0.1       , 0.55437666],
       [0.53333333, 0.70833333, 0.2       , 0.3       , 0.58819629],
       [0.2       , 0.66666667, 0.        , 0.1       , 0.43501326],
       [0.53333333, 0.54166667, 0.28      , 0.4       , 0.45291777],
       [0.33333333, 0.58333333, 0.36      , 0.1       , 0.41909814],
       [0.46666667, 0.41666667, 0.24      , 0.1       , 0.33156499],
       [0.46666667, 0.58333333, 0.24      , 0.3       , 0.46419098],
       [0.6       , 0.625     , 0.2       , 0.1       , 0.54376658],
       [0.6       , 0.58333333, 0.16      , 0.1       , 0.50928382],
       [0.26666667, 0.5       , 0.24      , 0.1       , 0.33421751],
       [0.33333333, 0.45833333, 0.24      , 0.1       , 0.32360743],
       [0.73333333, 0.58333333, 0.2       , 0.3       , 0.55437666],
       [0.6       , 0.875     , 0.2       , 0.        , 0.75066313],
       [0.8       , 0.91666667, 0.16      , 0.1       , 0.86870027],
       [0.4       , 0.45833333, 0.2       , 0.1       , 0.34416446],
       [0.46666667, 0.5       , 0.08      , 0.1       , 0.39787798],
       [0.8       , 0.625     , 0.12      , 0.1       , 0.61339523],
       [0.4       , 0.66666667, 0.16      , 0.        , 0.5066313 ],
       [0.06666667, 0.41666667, 0.12      , 0.1       , 0.21220159],
       [0.53333333, 0.58333333, 0.2       , 0.1       , 0.4867374 ],
       [0.46666667, 0.625     , 0.12      , 0.2       , 0.49734748],
       [0.13333333, 0.125     , 0.12      , 0.2       , 0.02320955],
       [0.06666667, 0.5       , 0.12      , 0.1       , 0.27055703],
       [0.46666667, 0.625     , 0.24      , 0.5       , 0.49734748],
       [0.53333333, 0.75      , 0.36      , 0.3       , 0.62201592],
       [0.33333333, 0.41666667, 0.16      , 0.2       , 0.29177719],
       [0.53333333, 0.75      , 0.24      , 0.1       , 0.62201592],
       [0.2       , 0.5       , 0.16      , 0.1       , 0.31299735],
       [0.66666667, 0.70833333, 0.2       , 0.1       , 0.6372679 ],
       [0.46666667, 0.54166667, 0.16      , 0.1       , 0.43103448],
       [0.4       , 0.16666667, 0.92      , 0.9       , 0.11671088],
       [0.46666667, 0.        , 1.        , 0.9       , 0.        ],
       [0.93333333, 0.25      , 1.        , 0.9       , 0.31962865],
       [0.46666667, 0.125     , 0.92      , 0.9       , 0.0994695 ],
       [0.53333333, 0.20833333, 0.8       , 1.        , 0.18236074]])

In [80]:
data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

In [81]:
sales_person

   sales_id  name  salary  commission_rate  hire_date
0         1  John  100000                6 2006-04-01
1         2   Amy   12000                5 2010-05-01
2         3  Mark   65000               12 2008-12-25
3         4   Pam   25000               25 2005-01-01
4         5  Alex    5000               10 2007-02-03

In [82]:
company

   com_id    name      city
0       1     RED    Boston
1       2  ORANGE  New York
2       3  YELLOW    Boston
3       4   GREEN    Austin

In [83]:
orders

   order_id order_date  com_id  sales_id  amount
0         1 2014-01-01       3         4   10000
1         2 2014-02-01       4         5    5000
2         3 2014-03-01       1         1   50000
3         4 2014-04-01       1         4   25000

In [ ]:
company